---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillCannotChangeType
source: html/877afc0f-3a3a-484b-0361-65a5738cdab3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillCannotChangeType Property

Infilling element replaced by a later phase insert must be the same type as the insert's host.

## Syntax (C#)
```csharp
public static FailureDefinitionId InfillCannotChangeType { get; }
```